[
  {"id":1,"term":"Soft skills in troubleshooting","definition":"Soft skills include communication, empathy, patience, and professionalism when assisting users or working with coworkers during troubleshooting.","image":""},
  {"id":2,"term":"Proper vs. improper communication","definition":"Proper communication is respectful, clear, and active; improper communication is dismissive, rude, or unclear.","image":""},
  {"id":3,"term":"Responsible for executing POST","definition":"The BIOS or UEFI firmware runs the Power-On Self-Test (POST) when the computer starts.","image":""},
  {"id":4,"term":"When hardware problems become evident","definition":"Hardware issues usually appear during POST or shortly after booting when components are stressed or fail to initialize.","image":""},
  {"id":5,"term":"Patch, update, and service pack","definition":"A patch fixes specific bugs or vulnerabilities, an update adds minor features or fixes, and a service pack is a large collection of updates and patches.","image":""},
  {"id":6,"term":"Key for Windows boot options","definition":"Pressing F8 or Shift+F8 during startup (or Shift+Restart from Windows) opens the Windows boot options menu.","image":""},
  {"id":7,"term":"RAM, ROM, and Flash Memory","definition":"RAM is volatile memory used for active data, ROM and Flash Memory are non-volatile; Flash can be rewritten, ROM cannot.","image":""},
  {"id":8,"term":"Power supply input and output","definition":"A power supply takes in AC (alternating current) from the wall and outputs DC (direct current) to computer components.","image":""},
  {"id":9,"term":"ECC, non-ECC, and registered memory","definition":"ECC memory detects and corrects errors for servers, non-ECC is standard consumer RAM, and registered memory stabilizes large memory setups.","image":""},
  {"id":10,"term":"Fastest and slowest memory chips","definition":"Cache memory (L1, L2, L3) is fastest, followed by RAM; hard drives and SSDs are much slower in comparison.","image":""},
  {"id":11,"term":"Monitor memory usage","definition":"Use Task Manager or the Performance Monitor in Windows to check installed memory and current usage.","image":""},
  {"id":12,"term":"Dual-channeling","definition":"Dual-channeling increases memory bandwidth by using two identical memory modules in paired slots.","image":""},
  {"id":13,"term":"Replacing memory considerations","definition":"Match the memory type, speed, voltage, and form factor supported by the motherboard.","image":""},
  {"id":14,"term":"Troubleshooting memory errors","definition":"Reseat RAM, test with one stick at a time, or use Windows Memory Diagnostic or MemTest86 to check for faults.","image":""},
  {"id":15,"term":"32-bit vs 64-bit systems and memory","definition":"32-bit systems access up to 4GB of RAM, while 64-bit systems can use much more and handle larger data sets.","image":""},
  {"id":16,"term":"Types of viruses","definition":"Viruses include worms, trojans, ransomware, spyware, and rootkits—each spreading or damaging systems differently.","image":""},
  {"id":17,"term":"Driver management","definition":"Drivers can be enabled, disabled, or updated through Windows Device Manager or manufacturer utilities.","image":""},
  {"id":18,"term":"Unrecoverable Windows error","definition":"An unrecoverable error causes a Blue Screen of Death (BSOD), forcing the system to halt to prevent damage.","image":""},
  {"id":19,"term":"RDP (Remote Desktop Protocol)","definition":"RDP allows remote access and control of another computer over a network connection.","image":""},
  {"id":20,"term":"Finding BSOD info","definition":"Use Event Viewer or the BlueScreenView tool to analyze BSOD stop codes and causes.","image":""},
  {"id":21,"term":"Windows event logs","definition":"Event logs record system, security, and application events for troubleshooting and auditing.","image":""},
  {"id":22,"term":"OEM vs retail Windows license","definition":"OEM licenses are tied to the first computer they’re activated on, while retail licenses can transfer between systems.","image":""},
  {"id":23,"term":"Ports and devices","definition":"Different ports serve devices like USB, HDMI, DisplayPort, and Ethernet; DisplayPort and HDMI provide the best video quality.","image":""},
  {"id":24,"term":"L1, L2, L3 cache order","definition":"L1 is the smallest and fastest, L2 is larger and slower, and L3 is shared among cores and the slowest cache level.","image":""},
  {"id":25,"term":"CPU word size","definition":"Word size is the number of bits the CPU processes in one operation, typically 32-bit or 64-bit.","image":""},
  {"id":26,"term":"Regular BIOS vs Flash BIOS","definition":"A Flash BIOS can be updated electronically, while a regular BIOS requires a chip replacement to update.","image":""},
  {"id":27,"term":"CMOS function","definition":"CMOS stores BIOS settings such as date, time, and hardware configuration.","image":""},
  {"id":28,"term":"BIOS and CMOS relationship","definition":"The BIOS uses data stored in CMOS memory to apply system settings during startup.","image":""},
  {"id":29,"term":"When ESD is most likely","definition":"ESD is most likely in dry, cool environments; touch a grounded metal object to discharge static if no wrist strap is available.","image":""},
  {"id":30,"term":"Technician service call items","definition":"Technicians should bring tools, documentation, replacement parts, and ESD protection gear on service calls.","image":""},
  {"id":31,"term":"Preventing ESD","definition":"Use antistatic wrist straps, mats, or self-grounding techniques to reduce electrostatic discharge risk.","image":""},
  {"id":32,"term":"Program testing hardware at startup","definition":"The POST (Power-On Self-Test) program checks essential hardware before the OS loads.","image":""},
  {"id":33,"term":"Documenting PC disassembly","definition":"Record each step, label screws and cables, and take photos to ensure correct reassembly.","image":""},
  {"id":34,"term":"Computer configuration methods","definition":"Computers can be configured through jumpers, BIOS/CMOS settings, or hardware options within Windows.","image":""},
  {"id":35,"term":"Replacing a CPU considerations","definition":"Ensure socket compatibility, BIOS support, proper cooling, and use thermal paste when installing a new CPU.","image":""},
  {"id":36,"term":"Traits of a good technician","definition":"A good technician is knowledgeable, patient, honest, professional, and maintains strong communication skills.","image":""}
]