[
  {"id":1,"term":"Administrator Password","definition":"A password set to restrict access to BIOS or system settings, usually for security purposes.","image":""},
  {"id":2,"term":"BIOS (basic input/output system)","definition":"Firmware that initializes and tests hardware during the booting process and provides runtime services for the operating system.","image":""},
  {"id":3,"term":"Boot Options","definition":"Settings in BIOS/UEFI that determine the order and devices the computer will attempt to boot from.","image":""},
  {"id":4,"term":"Boot Password","definition":"A password required at startup to allow the system to boot, preventing unauthorized access.","image":""},
  {"id":5,"term":"CMOS (complementary metal oxide semiconductor)","definition":"A small amount of memory on a motherboard that stores BIOS settings and is powered by a battery.","image":""},
  {"id":6,"term":"CMOS battery","definition":"A battery that provides power to the CMOS memory to retain BIOS settings when the system is powered off.","image":""},
  {"id":7,"term":"Device Manager","definition":"A Windows tool used to view and manage hardware devices and their drivers.","image":""},
  {"id":8,"term":"Disable Execute Bit","definition":"A security feature in BIOS that prevents certain types of malware from executing in memory.","image":""},
  {"id":9,"term":"Drive Encryption (BIOS)","definition":"A BIOS feature that enables encryption of a storage drive to protect data from unauthorized access.","image":""},
  {"id":10,"term":"eSATA bracket","definition":"An adapter bracket that provides external SATA ports for connecting eSATA devices.","image":""},
  {"id":11,"term":"eSATA card","definition":"A PCI or PCIe expansion card that adds eSATA ports to a computer for connecting external SATA drives.","image":""},
  {"id":12,"term":"ESCD (Extended System Configuration Data)","definition":"BIOS data that stores information about system resources like IRQs, DMA channels, and I/O addresses.","image":""},
  {"id":13,"term":"Fan Control","definition":"BIOS or UEFI settings that allow adjustment of system or CPU fan speeds for cooling and noise management.","image":""},
  {"id":14,"term":"firmware update","definition":"A process that upgrades the system's BIOS or firmware to fix bugs, add features, or improve security.","image":""},
  {"id":15,"term":"flash BIOS","definition":"The process of writing a new BIOS version to the motherboard's flash memory.","image":""},
  {"id":16,"term":"fTPM (firmware trusted platform module)","definition":"A TPM implementation in firmware that provides hardware-based security functions without a separate TPM chip.","image":""},
  {"id":17,"term":"I/O address (input/output address)","definition":"A unique identifier used by the CPU to communicate with hardware devices.","image":""},
  {"id":18,"term":"inaccurate system date/time","definition":"An error often caused by a failing CMOS battery or misconfigured BIOS settings.","image":""},
  {"id":19,"term":"Intrusion Detection/Notification","definition":"A BIOS feature that alerts users if the case has been opened or hardware tampered with.","image":""},
  {"id":20,"term":"IRQ (interrupt request)","definition":"A hardware signal that allows devices to interrupt the CPU to request processing time.","image":""},
  {"id":21,"term":"jumper","definition":"A small connector on a motherboard or device used to configure hardware settings by connecting pins.","image":""},
  {"id":22,"term":"LoJack (BIOS option)","definition":"A BIOS-enabled anti-theft feature that helps locate a stolen computer.","image":""},
  {"id":23,"term":"memory address","definition":"A unique location in memory used to store or retrieve data by the CPU or devices.","image":""},
  {"id":24,"term":"Passwords [BIOS]","definition":"Passwords set within the BIOS to restrict access to settings or to the system at boot.","image":""},
  {"id":25,"term":"registry","definition":"A Windows database that stores configuration settings and options for the operating system and applications.","image":""},
  {"id":26,"term":"secure boot","definition":"A UEFI feature that ensures only trusted software and operating systems can boot on the device.","image":""},
  {"id":27,"term":"security settings","definition":"BIOS or UEFI options that control authentication, encryption, and other security features.","image":""},
  {"id":28,"term":"Setup","definition":"The BIOS/UEFI interface used to configure system settings, hardware, and security options.","image":""},
  {"id":29,"term":"system attempts to boot to an  device","definition":"Occurs when the BIOS/UEFI tries to boot from a specific device, such as a hard drive or USB drive, based on boot order settings.","image":""},
  {"id":30,"term":"system resources","definition":"Hardware resources such as memory addresses, IRQs, and DMA channels allocated to devices for proper functioning.","image":""},
  {"id":31,"term":"UEFI (Unified Extensible Firmware Interface)","definition":"Modern firmware interface that replaces BIOS, supporting larger drives, faster booting, and secure boot features.","image":""},
  {"id":32,"term":"USB expansion card","definition":"A card added to a system to provide additional USB ports.","image":""},
  {"id":33,"term":"USB Permissions","definition":"Settings that control access to USB devices, often used for security and data protection.","image":""}
]