[
  {"id":1,"term":"32-bit architecture","definition":"A computer architecture that processes data and memory addresses that are 32 bits wide, limiting RAM to about 4 GB.","image":""},
  {"id":2,"term":"64-bit architecture","definition":"A computer architecture that processes 64-bit wide data and addresses, allowing vastly more RAM and better performance than 32-bit systems.","image":""},
  {"id":3,"term":"Active Directory (AD)","definition":"A Microsoft directory service that stores information about objects on a network and provides authentication and authorization.","image":""},
  {"id":4,"term":"Android OS","definition":"An open-source mobile operating system developed by Google, primarily used on smartphones and tablets.","image":""},
  {"id":5,"term":"Apple Macintosh OS","definition":"Apple’s proprietary operating system for Macintosh computers, commonly known as macOS.","image":""},
  {"id":6,"term":"Apply button","definition":"A button in software interfaces used to confirm and save changes without closing the window.","image":""},
  {"id":7,"term":"attribute","definition":"A property or characteristic of a file or folder, such as read-only, hidden, or system.","image":""},
  {"id":8,"term":"backup","definition":"A copy of data stored separately from the original to prevent loss in case of failure or corruption.","image":""},
  {"id":9,"term":"backward compatibility","definition":"The ability of newer software or hardware to work with older versions or formats.","image":""},
  {"id":10,"term":"BitLocker","definition":"A Windows security feature that provides full-disk encryption to protect data from unauthorized access.","image":""},
  {"id":11,"term":"BitLocker To Go","definition":"A feature of BitLocker that encrypts removable drives such as USB flash drives.","image":""},
  {"id":12,"term":"boot process","definition":"The sequence of steps a computer follows to start the operating system after being powered on.","image":""},
  {"id":13,"term":"Chrome OS","definition":"An operating system developed by Google that is based on Linux and designed to work primarily with web applications.","image":""},
  {"id":14,"term":"command-line interface","definition":"A text-based interface where users type commands to interact with the operating system or applications.","image":""},
  {"id":15,"term":"compression","definition":"A method of reducing the size of files to save storage space or speed up transfers.","image":""},
  {"id":16,"term":"context menu","definition":"A menu that appears when right-clicking an object, showing options relevant to that item.","image":""},
  {"id":17,"term":"Control Panel","definition":"A Windows tool that provides access to system settings and configuration options.","image":""},
  {"id":18,"term":"desktop","definition":"The main graphical workspace of an operating system where icons, files, and application windows are displayed.","image":""},
  {"id":19,"term":"Documents","definition":"A default Windows folder where users typically store personal files and documents.","image":""},
  {"id":20,"term":"domain access","definition":"The ability of a user or device to connect to and use resources in a Windows Active Directory domain.","image":""},
  {"id":21,"term":"EFS (Encrypting File System)","definition":"A Windows feature that allows individual files and folders to be encrypted for security.","image":""},
  {"id":22,"term":"end-of-life","definition":"The point at which a product, such as software, is no longer supported or updated by the manufacturer.","image":""},
  {"id":23,"term":"extensible software","definition":"Software that can be expanded or enhanced with plugins, modules, or updates.","image":""},
  {"id":24,"term":"extension","definition":"The suffix at the end of a filename (e.g., .txt, .jpg) that indicates the file type.","image":""},
  {"id":25,"term":"file type","definition":"The format of a file that determines how the data inside is structured and which applications can open it.","image":""},
  {"id":26,"term":"filename","definition":"The name given to a file, often combined with an extension to identify the file type.","image":""},
  {"id":27,"term":"folder","definition":"A container used in operating systems to organize files and other folders.","image":""},
  {"id":28,"term":"forward compatibility","definition":"The ability of older software or hardware to function in newer environments.","image":""},
  {"id":29,"term":"GUI (graphical user interface)","definition":"A visual way of interacting with a computer using windows, icons, and menus instead of text commands.","image":""},
  {"id":30,"term":"icon","definition":"A small graphical symbol that represents a program, file, or function on the desktop or interface.","image":""},
  {"id":31,"term":"indexing","definition":"The process of cataloging files and their contents to speed up search operations in an operating system.","image":""},
  {"id":32,"term":"iOS","definition":"Apple’s proprietary mobile operating system for iPhones and some iPads.","image":""},
  {"id":33,"term":"iPadOS","definition":"Apple’s mobile operating system designed specifically for iPads, based on iOS with added features.","image":""},
  {"id":34,"term":"library","definition":"A collection of related files and folders in Windows that appear as a single virtual location.","image":""},
  {"id":35,"term":"Linux","definition":"An open-source operating system kernel used in many distributions such as Ubuntu and Fedora.","image":""},
  {"id":36,"term":"macOS","definition":"Apple’s current operating system for Macintosh computers, successor to OS X.","image":""},
  {"id":37,"term":"Microsoft Windows","definition":"A widely used proprietary operating system developed by Microsoft for PCs.","image":""},
  {"id":38,"term":"network","definition":"A system of interconnected computers and devices that share resources and communicate with each other.","image":""},
  {"id":39,"term":"notification area (Windows)","definition":"The section of the Windows taskbar that displays system and application icons, such as clock, volume, and background apps.","image":""},
  {"id":40,"term":"open source","definition":"Software with source code made available for anyone to view, modify, and distribute.","image":""},
  {"id":41,"term":"proprietary operating system","definition":"An operating system owned by a company that restricts use, modification, or distribution.","image":""},
  {"id":42,"term":"RAM limitation","definition":"The maximum amount of memory an operating system or architecture can use effectively.","image":""},
  {"id":43,"term":"recovery drive","definition":"A storage device that contains tools to troubleshoot, repair, or reinstall an operating system.","image":""},
  {"id":44,"term":"Recycle Bin","definition":"A Windows feature that temporarily stores deleted files until permanently removed or restored.","image":""},
  {"id":45,"term":"regedit.exe","definition":"The Windows Registry Editor tool used to view and modify the system registry.","image":""},
  {"id":46,"term":"reload OS","definition":"The process of reinstalling an operating system to fix problems or restore it to default state.","image":""},
  {"id":47,"term":"security threat","definition":"A potential danger that could exploit vulnerabilities in software, hardware, or networks.","image":""},
  {"id":48,"term":"shortcut","definition":"A link that points to a file, folder, or application for quick access.","image":""},
  {"id":49,"term":"software incompatibility","definition":"A situation where a program does not function correctly because of conflicts with other software or the operating system.","image":""},
  {"id":50,"term":"Start button","definition":"A button in Windows used to access the Start menu and launch applications.","image":""},
  {"id":51,"term":"Start screen","definition":"The full-screen menu in Windows 8 that displayed tiles for applications and settings.","image":""},
  {"id":52,"term":"subdirectory","definition":"A directory within another directory used to organize files in a hierarchical structure.","image":""},
  {"id":53,"term":"subfolder","definition":"A folder within another folder used for file organization.","image":""},
  {"id":54,"term":"system image","definition":"A complete backup of a computer’s operating system, programs, and files.","image":""},
  {"id":55,"term":"Task View","definition":"A Windows feature that allows users to view all open windows and manage virtual desktops.","image":""},
  {"id":56,"term":"taskbar","definition":"A bar typically at the bottom of the screen in Windows that displays open applications and shortcuts.","image":""},
  {"id":57,"term":"This PC","definition":"A Windows interface that shows drives, folders, and system locations on the computer.","image":""},
  {"id":58,"term":"tile","definition":"A graphical element in Windows that represents an application or shortcut, often on the Start menu or screen.","image":""},
  {"id":59,"term":"upward compatibility","definition":"The ability of a system or program to take advantage of features in newer versions while still working correctly.","image":""},
  {"id":60,"term":"user profile","definition":"A collection of personal settings, files, and preferences associated with a specific user account.","image":""},
  {"id":61,"term":"Windows 10","definition":"A Microsoft operating system released in 2015 with features such as Cortana, virtual desktops, and the Start menu.","image":""},
  {"id":62,"term":"Windows 11","definition":"Microsoft’s latest operating system released in 2021, featuring a redesigned interface and enhanced productivity tools.","image":""},
  {"id":63,"term":"Windows Recovery Environment","definition":"A recovery platform included with Windows that provides tools to troubleshoot, repair, or restore the system.","image":""}
]