[
  {"id":1,"term":"Advanced Technology eXtended (ATX)","definition":"A motherboard and power supply specification that defines size, mounting points, and connector interfaces.","image":""},
  {"id":2,"term":"AGP (accelerated graphics port)","definition":"A high-speed point-to-point channel for attaching a graphics card to a computer's motherboard, primarily used before PCIe.","image":""},
  {"id":3,"term":"AMD (Advanced Micro Devices)","definition":"A company that manufactures processors, graphics cards, and other computer components.","image":""},
  {"id":4,"term":"APU (accelerated processing unit)","definition":"A CPU that combines traditional processing cores with integrated graphics on a single chip.","image":""},
  {"id":5,"term":"ARM processor","definition":"A processor architecture optimized for low power consumption, commonly used in mobile devices and embedded systems.","image":""},
  {"id":6,"term":"black screen","definition":"A computer display issue where no image appears, often caused by hardware, software, or connection problems.","image":""},
  {"id":7,"term":"burning smell","definition":"An indicator of possible electrical or component failure within a computer, such as overheated parts or short circuits.","image":""},
  {"id":8,"term":"cache memory","definition":"High-speed memory located on or near the CPU used to temporarily store frequently accessed data for faster processing.","image":""},
  {"id":9,"term":"capacitor swelling","definition":"A hardware issue where capacitors on a motherboard or component expand, often indicating failure or impending failure.","image":""},
  {"id":10,"term":"clock","definition":"A timing signal used by a processor to synchronize operations and control execution speed.","image":""},
  {"id":11,"term":"clock speed","definition":"The speed at which a processor executes instructions, measured in hertz (Hz), typically MHz or GHz.","image":""},
  {"id":12,"term":"continuous reboot","definition":"A problem where a computer restarts repeatedly without completing the boot process, often due to hardware or software issues.","image":""},
  {"id":13,"term":"CPU socket","definition":"The physical interface on a motherboard that houses a CPU and provides electrical and mechanical connections.","image":""},
  {"id":14,"term":"CPU speed","definition":"The rate at which a CPU can process instructions, often measured in GHz.","image":""},
  {"id":15,"term":"CPU throttling","definition":"The intentional reduction of CPU clock speed to prevent overheating or conserve power.","image":""},
  {"id":16,"term":"external data bus","definition":"A set of electrical paths that carry data between the CPU and other components outside the processor.","image":""},
  {"id":17,"term":"fan","definition":"A hardware component used to cool the CPU, GPU, or other computer parts by moving air.","image":""},
  {"id":18,"term":"form factor","definition":"The physical dimensions, layout, and design specifications of a motherboard or computer case.","image":""},
  {"id":19,"term":"FSB (front side bus)","definition":"The main data path connecting a CPU to the memory controller and other motherboard components.","image":""},
  {"id":20,"term":"GPU (graphics processing unit)","definition":"A processor specialized in rendering graphics and images, often integrated or on a separate graphics card.","image":""},
  {"id":21,"term":"grinding noise","definition":"A sound indicating possible mechanical failure, often from a hard drive or fan.","image":""},
  {"id":22,"term":"heat sink","definition":"A passive cooling device that dissipates heat from components such as CPUs or GPUs.","image":""},
  {"id":23,"term":"HSM (hardware security module)","definition":"A specialized device for managing and securing digital keys and cryptographic operations.","image":""},
  {"id":24,"term":"Hyperthreading (HT)","definition":"Intel technology that allows a single CPU core to act like two logical cores, improving multitasking performance.","image":""},
  {"id":25,"term":"HyperTransport","definition":"A high-speed, low-latency interconnect used for CPU-to-CPU or CPU-to-chipset communication.","image":""},
  {"id":26,"term":"integrated GPU (graphics processing unit)","definition":"A GPU built into the CPU or motherboard, sharing system memory rather than using dedicated video memory.","image":""},
  {"id":27,"term":"Intel Corporation","definition":"A multinational company that designs and manufactures CPUs, chipsets, and other computing technologies.","image":""},
  {"id":28,"term":"intermittent shutdown","definition":"A sporadic computer power-off issue often caused by overheating, power supply problems, or faulty hardware.","image":""},
  {"id":29,"term":"internal data bus","definition":"The set of electrical pathways that carry data within the CPU or between CPU and memory.","image":""},
  {"id":30,"term":"ITX (Information Technology eXtended)","definition":"A small motherboard form factor designed for compact systems.","image":""},
  {"id":31,"term":"L1 cache","definition":"The first-level CPU cache closest to the processor cores, used for storing critical data for quick access.","image":""},
  {"id":32,"term":"L2 cache","definition":"The second-level CPU cache that stores data not held in L1 cache, providing larger but slightly slower storage.","image":""},
  {"id":33,"term":"L3 cache","definition":"The third-level CPU cache shared among cores to improve processing efficiency and reduce latency.","image":""},
  {"id":34,"term":"liquid cooling","definition":"A method of cooling computer components using circulating liquid, often for CPUs or GPUs, to manage heat efficiently.","image":""},
  {"id":35,"term":"micro-ATX","definition":"A smaller version of the ATX motherboard form factor, compatible with smaller cases.","image":""},
  {"id":36,"term":"mobile device motherboard","definition":"The main circuit board in smartphones or tablets that integrates CPU, memory, and other essential components.","image":""},
  {"id":37,"term":"multicore","definition":"A processor with two or more independent cores capable of executing instructions simultaneously.","image":""},
  {"id":38,"term":"multisocket","definition":"A motherboard design that supports multiple CPU sockets for server or high-performance computing.","image":""},
  {"id":39,"term":"multithreading","definition":"The ability of a CPU to execute multiple threads simultaneously, improving performance in multitasking environments.","image":""},
  {"id":40,"term":"overclocking","definition":"Running a CPU or GPU at higher speeds than the manufacturer’s specifications to boost performance.","image":""},
  {"id":41,"term":"overheating","definition":"A condition where components become too hot, potentially causing system instability or hardware damage.","image":""},
  {"id":42,"term":"PCI (payment card industry)","definition":"A common abbreviation for Peripheral Component Interconnect, a standard for connecting expansion cards to a motherboard. Not to be confused with PCI security standards.","image":""},
  {"id":43,"term":"PCIe","definition":"Peripheral Component Interconnect Express, a high-speed expansion card interface used for graphics cards, SSDs, and other devices.","image":""},
  {"id":44,"term":"POST (power-on self-test)","definition":"A diagnostic process run by a computer at startup to check hardware components and system functionality.","image":""},
  {"id":45,"term":"POST beep","definition":"Audible signals produced during POST to indicate hardware status or errors.","image":""},
  {"id":46,"term":"processor","definition":"The central processing unit (CPU) that performs calculations and executes instructions for the computer.","image":""},
  {"id":47,"term":"proprietary crash screen","definition":"A system-specific error screen displayed when a serious system error occurs, such as the Blue Screen of Death on Windows.","image":""},
  {"id":48,"term":"server motherboard","definition":"A motherboard designed for servers with support for multiple CPUs, ECC memory, and high I/O capacity.","image":""},
  {"id":49,"term":"single-core processor","definition":"A CPU with only one processing core capable of executing one instruction thread at a time.","image":""},
  {"id":50,"term":"system lockup","definition":"A condition where the computer becomes unresponsive due to hardware or software failure.","image":""},
  {"id":51,"term":"thermal pad","definition":"A thermally conductive pad used to transfer heat from components to heat sinks or other cooling solutions.","image":""},
  {"id":52,"term":"thermal paste","definition":"A substance applied between a CPU or GPU and its heat sink to improve heat transfer and cooling efficiency.","image":""},
  {"id":53,"term":"thread","definition":"A sequence of programmed instructions that can be managed independently by a scheduler, often running on a CPU core.","image":""},
  {"id":54,"term":"throttle management","definition":"A method of controlling CPU or GPU performance to prevent overheating or conserve power.","image":""},
  {"id":55,"term":"TPM (Trusted Platform Module)","definition":"A secure hardware component used to store cryptographic keys and enhance security features.","image":""},
  {"id":56,"term":"unexpected shutdowns","definition":"Sudden loss of power or system shutdown caused by hardware, software, or power issues.","image":""},
  {"id":57,"term":"virtualization","definition":"Technology that allows multiple operating systems to run on a single physical machine using virtual machines.","image":""},
  {"id":58,"term":"virtualization support","definition":"CPU and motherboard features that enable efficient creation and management of virtual machines.","image":""},
  {"id":59,"term":"x64","definition":"A 64-bit processor architecture that supports larger amounts of RAM and enhanced performance over 32-bit architectures.","image":""},
  {"id":60,"term":"x86","definition":"A 32-bit processor architecture commonly used in older PCs, also referring to the family of Intel-compatible CPUs.","image":""},
  {"id":61,"term":"ZIF socket (zero insertion force socket)","definition":"A CPU socket design that allows processors to be inserted or removed without applying force, using a lever mechanism.","image":""}
]