[
  {"id":1,"term":"active listening","definition":"An effective communication technique that ensures what the speaker says is accurately received.","image":""},
  {"id":2,"term":"adapter","definition":"An electronic circuit card that can be inserted into an expansion slot. Also called a controller, card, controller card, circuit card, circuit board, or adapter board.","image":""},
  {"id":3,"term":"ADF (automatic document feeder)","definition":"A feature on a printer or multifunction device that allows paper to be fed into the device to be copied, scanned, or faxed, depending on the model and task.","image":""},
  {"id":4,"term":"bit","definition":"An electrically charged 1 or 0.","image":""},
  {"id":5,"term":"byte","definition":"8 bits grouped together as a basic unit.","image":""},
  {"id":6,"term":"clarify customer statement","definition":"A technique in which a technician asks open-ended questions that provide more information than questions that result in just yes or no answers.","image":""},
  {"id":7,"term":"device driver","definition":"Special software that allows an operating system to access a piece of hardware.","image":""},
  {"id":8,"term":"expansion slot","definition":"A motherboard socket to which adapters are connected.","image":""},
  {"id":9,"term":"flatbed scanner","definition":"A peripheral used to digitize photos and texts.","image":""},
  {"id":10,"term":"gigabyte","definition":"Approximately 1 billion bytes of information (exactly 1,073,741,824 bytes); abbreviated GB.","image":""},
  {"id":11,"term":"hard drive","definition":"A sealed data storage medium on which information is stored. Also called a hard disk.","image":""},
  {"id":12,"term":"hardware","definition":"A tangible, physical item, such as a keyboard or monitor.","image":""},
  {"id":13,"term":"headset","definition":"A mobile wearable device that commonly includes a microphone and headphones.","image":""},
  {"id":14,"term":"keyboard","definition":"A device that allows a user to provide input to a computer.","image":""},
  {"id":15,"term":"kilobyte","definition":"Approximately 1,000 bytes of information (exactly 1,024 bytes).","image":""},
  {"id":16,"term":"megabyte","definition":"Approximately 1 million bytes of data (exactly 1,048,576 bytes). Abbreviated MB.","image":""},
  {"id":17,"term":"memory","definition":"The part of a computer that temporarily stores applications, user documents, and system operating information.","image":""},
  {"id":18,"term":"microphone","definition":"An audio input device that can be integrated into a mobile device or that can be added externally, as with a wireless Bluetooth device; controlled with an app.","image":""},
  {"id":19,"term":"monitor","definition":"A device that displays information from a computer to a user.","image":""},
  {"id":20,"term":"motherboard","definition":"The main circuit board of a computer. Also known as the mainboard, planar, or system board.","image":""},
  {"id":21,"term":"mouse","definition":"A data input device that moves the cursor or selects menus and options.","image":""},
  {"id":22,"term":"open ended question","definition":"A soft skills technique that results in more information about a problem than questions that have just yes or no answers.","image":""},
  {"id":23,"term":"operating system (OS)","definition":"A piece of software that loads a computer and makes it operational.","image":""},
  {"id":24,"term":"optical drive","definition":"A storage device that accepts optical discs such as CDs, DVDs, or BDs that hold data, music, video, or software applications.","image":""},
  {"id":25,"term":"PC (personal computer)","definition":"A common name for a computer, derived from the IBM PC brand.","image":""},
  {"id":26,"term":"powersupply","definition":"A device that converts AC voltage into DC voltage that the computer can use to power all internal and some external devices.","image":""},
  {"id":27,"term":"printer","definition":"A peripheral used to output text and/or graphics onto paper.","image":""},
  {"id":28,"term":"RAM","definition":"A volatile type of memory that loses its data when power to the computer is shut off.","image":""},
  {"id":29,"term":"software","definition":"An application or operating system consisting of a set of instructions that makes the hardware work.","image":""},
  {"id":30,"term":"terabyte","definition":"Approximately 1 trillion bytes of information, or 240 (1,099,511,627,776) bytes.","image":""},
  {"id":31,"term":"webcam","definition":"Short for web camera, a small camera used for communicating via video across the internet.","image":""}
]