[
    {"id": 1, "term": "What type of adapter would have ports like this on it?", "definition": "Sound Adapter", "image": "https://i.imgur.com/I80aKGd.png"},
    {"id": 2, "term": "Which port adapter would convert from a digital signal to an analog signal?", "definition": "DVI-to-VGA", "image": ""},
    {"id": 3, "term": "What device would this adapter be used to attach to a PC?", "definition": "Keyboard", "image": "https://i.imgur.com/6wdcMV4.png"},
    {"id": 4, "term": "What is the maximum USB 3.0 cable length according to the specifications?", "definition": "3 meters", "image": ""},
    {"id": 5, "term": "What is the difference between an RJ-45 port and an RJ-11 port?", "definition": "RJ-45 has 8 conductors; RJ-11 has 4 conductors", "image": ""},
    {"id": 6, "term": "Which device would attach to the port shown in the graphic?", "definition": "Display", "image": "https://i.imgur.com/HTw2c0r.png"},
    {"id": 7, "term": "What is the maximum speed data can be transferred using USB 3.0?", "definition": "5 GB/s", "image": ""},
    {"id": 8, "term": "What is the difference between the two eSATA ports?", "definition": "The port on the right can accept both eSATA and USB cables.", "image": "https://i.imgur.com/BwDyTj4.png"},
    {"id": 9, "term": "Which two ports sometimes are identical in shape, size, and number of conductors?", "definition": "RJ11; RJ45", "image": ""},
    {"id": 10, "term": "(True/False) Windows 10, Android, IOS, and Microsoft Office are all operating systems.", "definition": "False", "image": ""},
    {"id": 11, "term": "Experience, knowledge of the basic hardware components, and a logical mind are characteristics associated with a...", "definition": "Computer Technician", "image": ""},
    {"id": 12, "term": "After turning on the PC, Bob notices that the monitor and case lights do not turn on and the screen is blank. He first checks the power plugs. Bob’s actions best illustrate the use of _____ in problem-solving.", "definition": "Logic", "image": ""},
    {"id": 13, "term": "This port is known as a...", "definition": "VGA port", "image": "https://i.imgur.com/hVbJwR2.png"},
    {"id": 14, "term": "This port is known as a...", "definition": "DVI port", "image": "https://i.imgur.com/ctszAze.png"},
    {"id": 15, "term": "The largest electronic board in a computer is the", "definition": "Motherboard", "image": ""},
    {"id": 16, "term": "What is the purpose of the motherboard component labeled A?", "definition": "CPU socket", "image": "https://i.imgur.com/keJpZDK.png"},
    {"id": 17, "term": "What is the purpose of the motherboard component labeled B?", "definition": "Memory slot", "image": "https://i.imgur.com/keJpZDK.png"},
    {"id": 18, "term": "What is the purpose of the motherboard component labeled C?", "definition": "Expansion slot", "image": "https://i.imgur.com/keJpZDK.png"},
    {"id": 19, "term": "Which type of cache memory is fastest for the processor to use?", "definition": "L1", "image": ""},
    {"id": 20, "term": "Which technology decreases the system workload on the CPU and can optionally process graphical data quickly with reduced power consumption?", "definition": "GPU", "image": ""},
    {"id": 21, "term": "What is the purpose of the handle on the right side of the processor?", "definition": "It is used to release and secure the processor into the socket.", "image": "https://i.imgur.com/LFsBkiI.png"},
    {"id": 22, "term": "Consider a motherboard that shows a specification of PCI-E version 2.0 x16. What does the x16 represent?", "definition": "The maximum number of bi-directional transmission lanes supported ", "image": ""},
    {"id": 23, "term": "Which expansion slot has the potential for being the fastest?", "definition": "PCIe", "image": ""},
    {"id": 24, "term": "An Intel processor needs to be replaced. Which specification must the technician obtain before obtaining the replacement processor?", "definition": "Socket size ", "image": ""},
    {"id": 25, "term": "Which of the following help with active listening?", "definition": "All of these help with active listening", "image": ""},
    {"id": 26, "term": "Where are selected BIOS options (settings) stored?", "definition": "CMOS", "image": ""},
    {"id": 27, "term": "What BIOS-stored program tests basic hardware as part of the computer startup routine?", "definition": "POST", "image": ""},
    {"id": 28, "term": "What is the purpose of the designated component (indicated by the blue arrow near the lower left side of the image?", "definition": "To store BIOS settings when the computer is powered off", "image": "https://i.imgur.com/cSx8udJ.png"},
    {"id": 29, "term": "Which BIOS option can prevent executable code that might be part of a virus from being executed from a specific marked memory area?", "definition": "Disable execute bit", "image": ""},
    {"id": 30, "term": "What is a common indication that the CMOS battery is failing?", "definition": "Light on the motherboard", "image": ""},
    {"id": 31, "term": "What Windows tool is used to determine whether there is a system resource conflict with any piece of hardware?", "definition": "Device Manager", "image": ""},
    {"id": 32, "term": "Which visual confirmation in Device Manager indicates a resource conflict or driver problem?", "definition": "Exclamation mark", "image": ""},
    {"id": 33, "term": "Which method is used to access Setup?", "definition": "A manufacturer-dependent keystroke", "image": ""},
    {"id": 34, "term": "(True/False) A BIOS/UEFI option may have to be enabled so that virtualization software can access additional hardware capabilities.", "definition": "True", "image": ""},
    {"id": 35, "term": "Where are Windows hardware and application software details stored?", "definition": "In the registry", "image": ""},
    {"id": 36, "term": "Which of the following is an example of EMI?", "definition": "A speaker crackles whenever a cell phone is near the PC.", "image": ""},
    {"id": 37, "term": "At what stage of building a computer would a technician install an I/O shield?", "definition": "Before installing the motherboard ", "image": ""},
    {"id": 38, "term": "Which two of the following can be applied to a lint-free cloth to clean an LCD?", "definition": "Water; Mixture of water and Isopropyl alcohol ", "image": ""},
    {"id": 39, "term": "In what instance would a technician use a toner vacuum?", "definition": "Inside a laser printer", "image": ""},
    {"id": 40, "term": "Which type of voltage do internal PC components use?", "definition": "DC", "image": ""},
    {"id": 41, "term": "What power protection would be the minimum you recommend for a full-time student who has limited finances and is living in a college dorm?", "definition": "Surge protector", "image": ""},
    {"id": 42, "term": "Which of the following power supplies is the most energy efficient?", "definition": "80 PLUS Platinum", "image": ""},
    {"id": 43, "term": "An ATX power supply has two 8-pin connectors. What are the purposes of the two connectors?", "definition": "CPU power; Video adapter", "image": ""}
]