[
  {"id":1,"term":"568A/B","definition":"Wiring standards for twisted-pair cabling used in Ethernet networks. T568A and T568B define pin assignments for RJ45 connectors.","image":""},
  {"id":2,"term":"analog signal","definition":"A continuous signal that varies over time, commonly used in older technologies like traditional phone lines and radio.","image":""},
  {"id":3,"term":"Bluetooth","definition":"A short-range wireless technology used to connect devices such as headsets, keyboards, and smartphones.","image":""},
  {"id":4,"term":"BNC connector (Bayonet Neill–Concelman connector)","definition":"A quick connect/disconnect coaxial cable connector used in older networks and video applications.","image":""},
  {"id":5,"term":"Cat 5","definition":"Category 5 twisted-pair cabling that supports data up to 100 Mbps at 100 MHz; mostly obsolete.","image":""},
  {"id":6,"term":"Cat 5e","definition":"Enhanced Category 5 cable that reduces crosstalk and supports speeds up to 1 Gbps.","image":""},
  {"id":7,"term":"Cat 6","definition":"Twisted-pair cable supporting speeds up to 10 Gbps at 250 MHz over shorter distances.","image":""},
  {"id":8,"term":"Cat 6a","definition":"Augmented Category 6 cable with better shielding, supporting 10 Gbps at 500 MHz over longer distances than Cat 6.","image":""},
  {"id":9,"term":"charging USB port","definition":"A USB port designed to provide higher power output for charging devices, even when the PC is off in some cases.","image":""},
  {"id":10,"term":"coaxial","definition":"A type of copper cable with a central conductor, insulation, shielding, and outer jacket; used in cable TV and broadband.","image":""},
  {"id":11,"term":"copper cabling","definition":"Networking cable that uses copper wires to transmit electrical signals; includes twisted-pair and coaxial.","image":""},
  {"id":12,"term":"DB9","definition":"A 9-pin D-subminiature connector used for older serial connections.","image":""},
  {"id":13,"term":"digital signal","definition":"A signal represented by discrete binary values (0s and 1s), used in modern computing and networking.","image":""},
  {"id":14,"term":"direct burial cable","definition":"Cable designed to be buried underground without additional conduit, with extra protection against moisture and damage.","image":""},
  {"id":15,"term":"DisplayPort","definition":"A digital display interface used to connect monitors, supporting audio and video.","image":""},
  {"id":16,"term":"DVI port","definition":"Digital Visual Interface; a video port used to connect displays. Variants include DVI-D and DVI-I.","image":""},
  {"id":17,"term":"DVI-D","definition":"A type of DVI connector that supports digital signals only.","image":""},
  {"id":18,"term":"DVI-I","definition":"A type of DVI connector that supports both digital and analog signals.","image":""},
  {"id":19,"term":"DVI-to-HDMI adapter","definition":"A converter that allows DVI video output to connect to an HDMI input device.","image":""},
  {"id":20,"term":"eSATA (External Serial ATA)","definition":"An external interface for connecting SATA storage devices outside the computer.","image":""},
  {"id":21,"term":"eSATA cable","definition":"The cable used with eSATA connections for external storage devices.","image":""},
  {"id":22,"term":"eSATAp port","definition":"A combination port supporting both eSATA and USB connections with power.","image":""},
  {"id":23,"term":"Ethernet port","definition":"Also called an RJ45 port; used to connect a computer to a wired network.","image":""},
  {"id":24,"term":"F type","definition":"A screw-on connector used with coaxial cable, common in cable TV and internet connections.","image":""},
  {"id":25,"term":"fiber cable","definition":"Cable that transmits data as light signals through glass or plastic fibers, supporting very high speeds and long distances.","image":""},
  {"id":26,"term":"HDMI (high-definition multimedia interface)","definition":"A connector that carries high-definition digital video and audio on a single cable.","image":""},
  {"id":27,"term":"header","definition":"Pins on a motherboard used to connect cables for front panel ports, lights, or buttons.","image":""},
  {"id":28,"term":"IR (infrared)","definition":"A wireless communication technology that uses infrared light, often for remote controls.","image":""},
  {"id":29,"term":"keyboard port","definition":"A legacy PS/2 port used to connect a keyboard.","image":""},
  {"id":30,"term":"Lightning port","definition":"Apple’s proprietary connector for iPhones, iPads, and accessories.","image":""},
  {"id":31,"term":"Lucent connector (LC)","definition":"A small form-factor fiber optic connector used for high-density connections.","image":""},
  {"id":32,"term":"microUSB","definition":"A smaller USB connector commonly used for older smartphones and accessories.","image":""},
  {"id":33,"term":"mini-DIN","definition":"A family of multipin connectors, including PS/2 ports for keyboard and mouse.","image":""},
  {"id":34,"term":"miniUSB","definition":"An older USB connector type, larger than microUSB, used in cameras and older devices.","image":""},
  {"id":35,"term":"modem (modulator/demodulator)","definition":"A device that converts digital signals to analog for transmission over phone lines and vice versa.","image":""},
  {"id":36,"term":"mouse port","definition":"A legacy PS/2 port used to connect a mouse.","image":""},
  {"id":37,"term":"multi-mode fiber","definition":"Fiber optic cable that carries multiple light signals simultaneously, suitable for shorter distances.","image":""},
  {"id":38,"term":"network port","definition":"Another name for an Ethernet port (RJ45).","image":""},
  {"id":39,"term":"NFC (near field communication)","definition":"A short-range wireless technology for close contact data transfer, such as mobile payments.","image":""},
  {"id":40,"term":"NIC (network interface card)","definition":"A hardware component that connects a computer to a network, wired or wireless.","image":""},
  {"id":41,"term":"PD (Power Delivery)","definition":"A USB specification that allows higher power transfer for charging devices like laptops and phones.","image":""},
  {"id":42,"term":"plenum cable","definition":"Network cable rated for use in air-handling spaces with fire-resistant insulation.","image":""},
  {"id":43,"term":"port","definition":"A physical interface on a computer used to connect peripherals or networks.","image":""},
  {"id":44,"term":"PS/2 port","definition":"A legacy round connector used for keyboards and mice.","image":""},
  {"id":45,"term":"punchdown block","definition":"A panel where wires are connected and terminated for network or phone cabling.","image":""},
  {"id":46,"term":"punchdown tool","definition":"A tool used to press wires into slots of a punchdown block, making secure connections.","image":""},
  {"id":47,"term":"PVC (polyvinyl chloride)","definition":"A common cable jacket material that is not fire-resistant, unlike plenum-rated cables.","image":""},
  {"id":48,"term":"radio","definition":"Wireless communication using radio frequency signals.","image":""},
  {"id":49,"term":"RCA","definition":"A connector used for analog audio and video signals, common in older home equipment.","image":""},
  {"id":50,"term":"RJ11","definition":"A connector used for telephone lines, typically with 4 or 6 positions.","image":""},
  {"id":51,"term":"RJ45","definition":"The connector used for Ethernet twisted-pair cabling, typically with 8 positions.","image":""},
  {"id":52,"term":"S-video port","definition":"A legacy video port that separates brightness and color signals for better quality than composite video.","image":""},
  {"id":53,"term":"S/PDIF (Sony/Phillips Digital Interface Format)","definition":"A digital audio interface used to transfer sound between devices without converting to analog.","image":""},
  {"id":54,"term":"serial cable","definition":"A cable used for serial communication, often with DB9 connectors.","image":""},
  {"id":55,"term":"single-mode fiber","definition":"Fiber optic cable designed to carry a single light signal over long distances.","image":""},
  {"id":56,"term":"sleep-and-charge USB port","definition":"A USB port that continues to provide power for charging devices even when the computer is off or asleep.","image":""},
  {"id":57,"term":"sound card","definition":"An expansion card or integrated component that processes audio input and output.","image":""},
  {"id":58,"term":"straight tip (ST) connector","definition":"A fiber optic connector that uses a twist-on mechanism, common in older fiber networks.","image":""},
  {"id":59,"term":"subscriber connector (SC)","definition":"A push-pull fiber optic connector used in network environments.","image":""},
  {"id":60,"term":"T568A","definition":"A wiring standard for RJ45 connectors that defines pin assignments for Ethernet cabling.","image":""},
  {"id":61,"term":"T568B","definition":"An alternative wiring standard for RJ45 connectors, more common in the U.S.","image":""},
  {"id":62,"term":"Thunderbolt","definition":"A high-speed interface developed by Intel and Apple that combines PCIe, DisplayPort, and power in a single connection.","image":""},
  {"id":63,"term":"TOSLINK","definition":"An optical fiber connector used for digital audio connections, such as between a DVD player and a receiver.","image":""},
  {"id":64,"term":"unshielded twisted pair","definition":"Copper cabling with pairs of wires twisted together to reduce interference; commonly used in Ethernet networks.","image":""},
  {"id":65,"term":"USB (Universal Serial Bus)","definition":"A standard interface used to connect peripherals such as keyboards, mice, and storage devices.","image":""},
  {"id":66,"term":"USB 2.0","definition":"An older USB standard supporting transfer speeds up to 480 Mbps.","image":""},
  {"id":67,"term":"USB 3.0","definition":"A USB standard supporting transfer speeds up to 5 Gbps, often identified by blue connectors.","image":""},
  {"id":68,"term":"USB Type-A","definition":"The standard flat rectangular USB connector found on most computers.","image":""},
  {"id":69,"term":"USB Type-B","definition":"A square-shaped USB connector commonly used for printers and other peripherals.","image":""},
  {"id":70,"term":"USB Type-C","definition":"A small, reversible USB connector that supports faster speeds and power delivery.","image":""},
  {"id":71,"term":"USB-PD","definition":"USB Power Delivery; a specification that increases power output for charging larger devices.","image":""},
  {"id":72,"term":"USB-to-Ethernet converter","definition":"An adapter that allows a USB port to connect to a wired Ethernet network.","image":""},
  {"id":73,"term":"VGA port","definition":"A legacy 15-pin video graphics array port used to connect analog monitors.","image":""}
]