[
  {"id":1,"term":"20-pin to24-pin motherboard adapter","definition":"A device used to connect a 20-pin power supply to a 24-pin motherboard connector.","image":""},
  {"id":2,"term":"+12V","definition":"A 12-volt DC electrical rail commonly used to power CPU and GPU components in a computer.","image":""},
  {"id":3,"term":"24-pin motherboard connector","definition":"The main power connector on a motherboard that provides various voltage rails to components.","image":""},
  {"id":4,"term":"3.3V","definition":"A voltage rail used by some motherboard components and low-power devices.","image":""},
  {"id":5,"term":"4-pin 12V","definition":"A connector used to supply additional 12V power to the CPU on the motherboard.","image":""},
  {"id":6,"term":"6-pin PCIe","definition":"A connector that provides power to certain PCI Express graphics cards.","image":""},
  {"id":7,"term":"8-pin PCIe","definition":"A connector supplying extra power to high-end PCI Express graphics cards.","image":""},
  {"id":8,"term":"AC (alternating current)","definition":"Electric current that reverses direction periodically, used in homes and businesses.","image":""},
  {"id":9,"term":"AC circuit tester","definition":"A device used to check the presence of alternating current in a circuit or outlet.","image":""},
  {"id":10,"term":"ACPI (Advanced Configuration and Power Interface)","definition":"A standard that allows the operating system to control the amount of power given to each device attached to the computer.","image":""},
  {"id":11,"term":"air filter/mask","definition":"Protective equipment used to prevent inhalation of dust or particles when working with computer hardware.","image":""},
  {"id":12,"term":"amp","definition":"A unit of electrical current, measuring the flow of electrons in a circuit.","image":""},
  {"id":13,"term":"antistatic bag","definition":"A bag designed to protect electronic components from electrostatic discharge (ESD).","image":""},
  {"id":14,"term":"antistatic wrist strap","definition":"A strap worn by technicians to safely ground themselves and prevent ESD damage.","image":""},
  {"id":15,"term":"cable management system","definition":"A system used to organize, route, and secure cables within a computer or server rack.","image":""},
  {"id":16,"term":"compressed air","definition":"Air stored under pressure and released to clean dust and debris from electronics.","image":""},
  {"id":17,"term":"computer reboot","definition":"The process of restarting a computer to refresh system memory and software.","image":""},
  {"id":18,"term":"continuity","definition":"The presence of a complete electrical path in a circuit, indicating no breaks.","image":""},
  {"id":19,"term":"DC (direct current)","definition":"Electric current that flows in a single direction, commonly used by electronic devices.","image":""},
  {"id":20,"term":"dual-rail power supply","definition":"A power supply design that splits the 12V rail into two separate circuits for improved stability.","image":""},
  {"id":21,"term":"EMI (electromagnetic interference)","definition":"Disturbances caused by electromagnetic fields that can affect the operation of electronic devices.","image":""},
  {"id":22,"term":"equipment grounding","definition":"The process of connecting electrical devices to the earth to prevent electrical shock and damage.","image":""},
  {"id":23,"term":"ESD (electrostatic discharge)","definition":"The sudden flow of electricity between two electrically charged objects, potentially damaging electronics.","image":""},
  {"id":24,"term":"ESD mat","definition":"A grounded mat used to protect electronic components from electrostatic discharge during handling.","image":""},
  {"id":25,"term":"ESD strap","definition":"Another term for an antistatic wrist strap used to prevent electrostatic discharge.","image":""},
  {"id":26,"term":"front panel connector","definition":"Connectors on the motherboard used to attach buttons, LEDs, and ports on the computer case.","image":""},
  {"id":27,"term":"I/O shield","definition":"A metal plate that fits in the back of the computer case to align motherboard ports with the openings.","image":""},
  {"id":28,"term":"IDE (Integrated Drive Electronics)","definition":"An older standard for connecting storage devices like hard drives and optical drives.","image":""},
  {"id":29,"term":"maintenance kit","definition":"A set of tools and supplies used to maintain and service computer hardware.","image":""},
  {"id":30,"term":"modular power supply","definition":"A power supply that allows users to connect only the cables they need, reducing clutter.","image":""},
  {"id":31,"term":"Molex","definition":"A type of connector used to provide power to older storage devices and peripherals.","image":""},
  {"id":32,"term":"MSDS (material safety data sheet)","definition":"A document that provides information on the properties, hazards, and safe handling of materials.","image":""},
  {"id":33,"term":"no power","definition":"A condition where a device or system fails to receive electrical power.","image":""},
  {"id":34,"term":"ohm","definition":"The unit of electrical resistance, indicating how much a material resists the flow of current.","image":""},
  {"id":35,"term":"power","definition":"The rate at which electrical energy is transferred or consumed, measured in watts.","image":""},
  {"id":36,"term":"power supply tester","definition":"A device used to verify the output voltages and functionality of a computer power supply.","image":""},
  {"id":37,"term":"preventive maintenance","definition":"Routine maintenance performed to prevent equipment failure and prolong lifespan.","image":""},
  {"id":38,"term":"redundant power supply","definition":"A system design using two or more power supplies to ensure continuous operation if one fails.","image":""},
  {"id":39,"term":"resistance","definition":"A measure of how much a material opposes the flow of electric current, measured in ohms.","image":""},
  {"id":40,"term":"RFI (radio frequency interference)","definition":"Interference caused by radio frequency signals that can disrupt electronic equipment.","image":""},
  {"id":41,"term":"safety goggles","definition":"Protective eyewear used to prevent injury when handling tools or chemicals.","image":""},
  {"id":42,"term":"SATA connector","definition":"A connector used to connect modern hard drives and SSDs to the motherboard for data transfer.","image":""},
  {"id":43,"term":"SDS (safety data sheet)","definition":"Updated version of MSDS providing safety, handling, and disposal information for chemicals.","image":""},
  {"id":44,"term":"self-grounding","definition":"A method of grounding oneself or a device without additional tools or straps, typically via conductive surfaces.","image":""},
  {"id":45,"term":"smoke","definition":"A sign of overheating or electrical failure in electronic components.","image":""},
  {"id":46,"term":"standoff","definition":"A spacer used to keep the motherboard elevated above the computer case to prevent short circuits.","image":""},
  {"id":47,"term":"toner vacuum","definition":"A vacuum specifically designed to safely remove toner particles from printers and copiers.","image":""},
  {"id":48,"term":"volt","definition":"Unit of electrical potential or electromotive force.","image":""},
  {"id":49,"term":"voltage","definition":"The electrical potential difference between two points, measured in volts.","image":""},
  {"id":50,"term":"Wake on LAN","definition":"A feature allowing a computer to be powered on remotely via a network message.","image":""},
  {"id":51,"term":"Wake on Ring","definition":"A feature that allows a computer to power on or wake up when it detects a modem signal.","image":""},
  {"id":52,"term":"watt","definition":"A unit of electrical power equal to one joule per second.","image":""},
  {"id":53,"term":"wattage rating","definition":"The maximum amount of power a device or power supply can safely deliver.","image":""},
  {"id":54,"term":"written communication","definition":"The act of conveying information or instructions through written text.","image":""}
]