[
  {"id":1,"term":"DRAM (dynamic random-access memory)","definition":"A type of memory used in computers that stores each bit of data in a separate capacitor, requiring periodic refresh to maintain data.","image":""},
  {"id":2,"term":"application crash","definition":"When a software program unexpectedly stops functioning or closes due to an error.","image":""},
  {"id":3,"term":"attitude","definition":"A mindset or approach a person brings to their work or interactions, often affecting performance and teamwork.","image":""},
  {"id":4,"term":"be on time","definition":"Arriving or completing tasks at the scheduled or expected time.","image":""},
  {"id":5,"term":"buffered memory","definition":"RAM that includes a register between the DRAM and the system’s memory controller to reduce electrical load and improve stability.","image":""},
  {"id":6,"term":"CL rating (column address strobe [CAS] latency rating)","definition":"The delay time between the memory controller requesting data and the memory module delivering it, measured in clock cycles.","image":""},
  {"id":7,"term":"Compatibility Mode","definition":"A setting that allows software or hardware to function as if it were running in an older version of an operating system or environment.","image":""},
  {"id":8,"term":"DDR3 (Double Data Rate 3)","definition":"A type of SDRAM used in computers, offering faster data transfer rates than DDR2.","image":""},
  {"id":9,"term":"DDR4 (Double Data Rate 4)","definition":"A more advanced type of SDRAM with higher speed and lower voltage than DDR3.","image":""},
  {"id":10,"term":"DDR5 (Double Data Rate 5)","definition":"The latest generation of SDRAM providing even higher speeds, improved bandwidth, and lower power consumption than DDR4.","image":""},
  {"id":11,"term":"DIMM (dual inline memory module)","definition":"A memory module with separate electrical contacts on each side of the module, used in desktops and servers.","image":""},
  {"id":12,"term":"dual-channel","definition":"A memory configuration that uses two identical RAM modules simultaneously to double data transfer bandwidth.","image":""},
  {"id":13,"term":"ECC (error correcting code)","definition":"Memory capable of detecting and correcting single-bit errors to improve reliability, often used in servers.","image":""},
  {"id":14,"term":"flash drive","definition":"A portable storage device that uses flash memory to store data and connects via USB.","image":""},
  {"id":15,"term":"flash memory","definition":"Non-volatile memory that retains data without power, commonly used in USB drives and SSDs.","image":""},
  {"id":16,"term":"heat spreader","definition":"A component attached to memory modules or CPUs to dissipate heat and maintain stable operation.","image":""},
  {"id":17,"term":"maintain a positive attitude","definition":"Continuing to approach tasks and challenges with optimism and constructive behavior.","image":""},
  {"id":18,"term":"memory card reader","definition":"A device that reads and writes data to removable memory cards, such as SD or microSD cards.","image":""},
  {"id":19,"term":"non-parity","definition":"Memory that does not include an extra bit for error checking, making it less expensive but less reliable than parity memory.","image":""},
  {"id":20,"term":"paging file","definition":"A reserved portion of storage on a hard drive used as virtual memory when physical RAM is full.","image":""},
  {"id":21,"term":"performance (virtual memory)","definition":"The effect on system speed and responsiveness when virtual memory is used to supplement physical RAM.","image":""},
  {"id":22,"term":"Performance utility","definition":"Software tools used to monitor, test, or improve the performance of a computer system.","image":""},
  {"id":23,"term":"pinwheel","definition":"A spinning cursor or graphic indicating that an application is busy or unresponsive, commonly seen in operating systems like macOS.","image":""},
  {"id":24,"term":"project confidence","definition":"Demonstrating assurance and competence in one’s skills and decisions.","image":""},
  {"id":25,"term":"quad-channel","definition":"A memory configuration that uses four identical RAM modules simultaneously to increase data transfer bandwidth.","image":""},
  {"id":26,"term":"SODIMM (small outline DIMM)","definition":"A smaller memory module designed for laptops and compact devices.","image":""},
  {"id":27,"term":"SPD (serial presence detect)","definition":"A chip on memory modules that stores information about the module’s size, speed, voltage, and timings so the system can automatically configure it.","image":""},
  {"id":28,"term":"SRAM (static random-access memory)","definition":"A type of memory that does not require refreshing and is faster but more expensive than DRAM, often used in cache.","image":""},
  {"id":29,"term":"teamwork","definition":"Cooperative effort by a group of people to achieve a common goal effectively and efficiently.","image":""},
  {"id":30,"term":"unbuffered memory","definition":"RAM without a register, directly connected to the memory controller, typically faster but less stable than buffered memory.","image":""},
  {"id":31,"term":"virtual machine","definition":"A software emulation of a physical computer that runs an operating system and applications in an isolated environment.","image":""},
  {"id":32,"term":"virtual RAM","definition":"A portion of storage used to simulate additional RAM when physical memory is insufficient.","image":""},
  {"id":33,"term":"Windows Memory Diagnostic tool","definition":"A built-in Windows utility used to check the computer’s RAM for errors.","image":""}
]